#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.infrastructure.module.iam.google_service_account.worker: Refreshing state... [id=projects/breatheroute/serviceAccounts/breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_service_account.api: Refreshing state... [id=projects/breatheroute/serviceAccounts/breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.google_project_service.apis["monitoring.googleapis.com"]: Refreshing state... [id=breatheroute/monitoring.googleapis.com]
module.infrastructure.google_project_service.apis["sqladmin.googleapis.com"]: Refreshing state... [id=breatheroute/sqladmin.googleapis.com]
module.infrastructure.google_project_service.apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=breatheroute/cloudresourcemanager.googleapis.com]
module.infrastructure.google_project_service.apis["iam.googleapis.com"]: Refreshing state... [id=breatheroute/iam.googleapis.com]
module.infrastructure.google_project_service.apis["cloudscheduler.googleapis.com"]: Refreshing state... [id=breatheroute/cloudscheduler.googleapis.com]
module.infrastructure.google_project_service.apis["secretmanager.googleapis.com"]: Refreshing state... [id=breatheroute/secretmanager.googleapis.com]
module.infrastructure.google_project_service.apis["pubsub.googleapis.com"]: Refreshing state... [id=breatheroute/pubsub.googleapis.com]
module.infrastructure.google_project_service.apis["logging.googleapis.com"]: Refreshing state... [id=breatheroute/logging.googleapis.com]
module.infrastructure.google_project_service.apis["redis.googleapis.com"]: Refreshing state... [id=breatheroute/redis.googleapis.com]
module.infrastructure.google_project_service.apis["vpcaccess.googleapis.com"]: Refreshing state... [id=breatheroute/vpcaccess.googleapis.com]
module.infrastructure.google_project_service.apis["cloudtrace.googleapis.com"]: Refreshing state... [id=breatheroute/cloudtrace.googleapis.com]
module.infrastructure.google_project_service.apis["run.googleapis.com"]: Refreshing state... [id=breatheroute/run.googleapis.com]
module.infrastructure.module.iam.google_project_iam_member.worker_sql_client: Refreshing state... [id=breatheroute/roles/cloudsql.client/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.google_project_service.apis["artifactregistry.googleapis.com"]: Refreshing state... [id=breatheroute/artifactregistry.googleapis.com]
module.infrastructure.google_project_service.apis["servicenetworking.googleapis.com"]: Refreshing state... [id=breatheroute/servicenetworking.googleapis.com]
module.infrastructure.module.iam.google_project_iam_member.worker_pubsub_publisher: Refreshing state... [id=breatheroute/roles/pubsub.publisher/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.worker_logging_writer: Refreshing state... [id=breatheroute/roles/logging.logWriter/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.worker_trace_agent: Refreshing state... [id=breatheroute/roles/cloudtrace.agent/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.worker_secret_accessor: Refreshing state... [id=breatheroute/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.worker_monitoring_writer: Refreshing state... [id=breatheroute/roles/monitoring.metricWriter/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.worker_pubsub_subscriber: Refreshing state... [id=breatheroute/roles/pubsub.subscriber/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.api_monitoring_writer: Refreshing state... [id=breatheroute/roles/monitoring.metricWriter/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.api_sql_client: Refreshing state... [id=breatheroute/roles/cloudsql.client/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.api_trace_agent: Refreshing state... [id=breatheroute/roles/cloudtrace.agent/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.api_secret_accessor: Refreshing state... [id=breatheroute/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.api_pubsub_publisher: Refreshing state... [id=breatheroute/roles/pubsub.publisher/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.iam.google_project_iam_member.api_logging_writer: Refreshing state... [id=breatheroute/roles/logging.logWriter/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_topic.gdpr_deletion: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-gdpr-deletion]
module.infrastructure.google_artifact_registry_repository.containers: Refreshing state... [id=projects/breatheroute/locations/europe-west4/repositories/breatheroute]
module.infrastructure.module.secrets.google_secret_manager_secret.webhook_signing_secret: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-webhook-signing-secret]
module.infrastructure.module.secrets.google_secret_manager_secret.luchtmeetnet_api_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-luchtmeetnet-api-key]
module.infrastructure.module.secrets.google_secret_manager_secret.pollen_api_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-pollen-api-key]
module.infrastructure.module.secrets.google_secret_manager_secret.apns_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-apns-key]
module.infrastructure.module.pubsub.google_pubsub_topic.gdpr_export: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-gdpr-export]
module.infrastructure.module.secrets.google_secret_manager_secret.db_password: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-db-password]
module.infrastructure.module.secrets.google_secret_manager_secret.jwt_signing_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-jwt-signing-key]
module.infrastructure.module.networking.google_compute_network.main: Refreshing state... [id=projects/breatheroute/global/networks/breatheroute-prod-vpc]
module.infrastructure.module.pubsub.data.google_project.current: Reading...
module.infrastructure.module.pubsub.google_pubsub_topic.alert_evaluation: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-alert-evaluation]
module.infrastructure.module.pubsub.google_pubsub_topic.dead_letter: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-dead-letter]
module.infrastructure.module.pubsub.google_pubsub_topic.provider_refresh: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-provider-refresh]
module.infrastructure.module.secrets.google_secret_manager_secret.ns_api_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-ns-api-key]
module.infrastructure.module.pubsub.google_pubsub_topic.webhook_delivery: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-webhook-delivery]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_apns: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-apns-key/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_version.apns_key: Refreshing state... [id=projects/776266880935/secrets/breatheroute-prod-apns-key/versions/1]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_luchtmeetnet: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-luchtmeetnet-api-key/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_luchtmeetnet: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-luchtmeetnet-api-key/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_version.luchtmeetnet_api_key: Refreshing state... [id=projects/776266880935/secrets/breatheroute-prod-luchtmeetnet-api-key/versions/1]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_jwt_key: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-jwt-signing-key/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_version.jwt_signing_key: Refreshing state... [id=projects/776266880935/secrets/breatheroute-prod-jwt-signing-key/versions/1]
module.infrastructure.module.pubsub.data.google_project.current: Read complete after 0s [id=projects/breatheroute]
module.infrastructure.module.secrets.google_secret_manager_secret_version.webhook_signing_secret: Refreshing state... [id=projects/776266880935/secrets/breatheroute-prod-webhook-signing-secret/versions/1]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_webhook: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-webhook-signing-secret/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_version.pollen_api_key: Refreshing state... [id=projects/776266880935/secrets/breatheroute-prod-pollen-api-key/versions/1]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_pollen: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-pollen-api-key/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_pollen: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-pollen-api-key/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_db_password: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-db-password/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.worker_db_password: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-db-password/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.secrets.google_secret_manager_secret_version.db_password: Refreshing state... [id=projects/776266880935/secrets/breatheroute-prod-db-password/versions/1]
module.infrastructure.module.pubsub.google_pubsub_subscription.dead_letter: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-dead-letter-sub]
module.infrastructure.module.pubsub.google_pubsub_subscription.provider_refresh: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-provider-refresh-sub]
module.infrastructure.module.pubsub.google_pubsub_subscription.gdpr_deletion: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-gdpr-deletion-sub]
module.infrastructure.module.pubsub.google_pubsub_subscription.gdpr_export: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-gdpr-export-sub]
module.infrastructure.module.pubsub.google_pubsub_subscription.alert_evaluation: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-alert-evaluation-sub]
module.infrastructure.module.pubsub.google_pubsub_subscription.webhook_delivery: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-webhook-delivery-sub]
module.infrastructure.module.secrets.google_secret_manager_secret_version.ns_api_key: Refreshing state... [id=projects/776266880935/secrets/breatheroute-prod-ns-api-key/versions/1]
module.infrastructure.module.secrets.google_secret_manager_secret_iam_member.api_ns: Refreshing state... [id=projects/breatheroute/secrets/breatheroute-prod-ns-api-key/roles/secretmanager.secretAccessor/serviceAccount:breatheroute-prod-api-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_topic_iam_member.pubsub_agent_dead_letter_publisher: Refreshing state... [id=projects/breatheroute/topics/breatheroute-prod-dead-letter/roles/pubsub.publisher/serviceAccount:service-776266880935@gcp-sa-pubsub.iam.gserviceaccount.com]
module.infrastructure.module.networking.google_compute_firewall.allow_internal: Refreshing state... [id=projects/breatheroute/global/firewalls/breatheroute-prod-allow-internal]
module.infrastructure.module.networking.google_compute_subnetwork.main: Refreshing state... [id=projects/breatheroute/regions/europe-west4/subnetworks/breatheroute-prod-subnet]
module.infrastructure.module.networking.google_vpc_access_connector.connector: Refreshing state... [id=projects/breatheroute/locations/europe-west4/connectors/prod-vpc-conn]
module.infrastructure.module.networking.google_compute_firewall.allow_health_checks: Refreshing state... [id=projects/breatheroute/global/firewalls/breatheroute-prod-allow-health-checks]
module.infrastructure.module.networking.google_compute_global_address.private_ip_range: Refreshing state... [id=projects/breatheroute/global/addresses/breatheroute-prod-private-ip-range]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_provider_refresh: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-provider-refresh-sub/roles/pubsub.subscriber/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.pubsub_agent_provider_refresh_subscriber: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-provider-refresh-sub/roles/pubsub.subscriber/serviceAccount:service-776266880935@gcp-sa-pubsub.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_alert_evaluation: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-alert-evaluation-sub/roles/pubsub.subscriber/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.pubsub_agent_alert_evaluation_subscriber: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-alert-evaluation-sub/roles/pubsub.subscriber/serviceAccount:service-776266880935@gcp-sa-pubsub.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.pubsub_agent_gdpr_export_subscriber: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-gdpr-export-sub/roles/pubsub.subscriber/serviceAccount:service-776266880935@gcp-sa-pubsub.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_gdpr_export: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-gdpr-export-sub/roles/pubsub.subscriber/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_webhook_delivery: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-webhook-delivery-sub/roles/pubsub.subscriber/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.pubsub_agent_webhook_delivery_subscriber: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-webhook-delivery-sub/roles/pubsub.subscriber/serviceAccount:service-776266880935@gcp-sa-pubsub.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.pubsub_agent_gdpr_deletion_subscriber: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-gdpr-deletion-sub/roles/pubsub.subscriber/serviceAccount:service-776266880935@gcp-sa-pubsub.iam.gserviceaccount.com]
module.infrastructure.module.pubsub.google_pubsub_subscription_iam_member.worker_gdpr_deletion: Refreshing state... [id=projects/breatheroute/subscriptions/breatheroute-prod-gdpr-deletion-sub/roles/pubsub.subscriber/serviceAccount:breatheroute-prod-worker-sa@breatheroute.iam.gserviceaccount.com]
module.infrastructure.module.networking.google_service_networking_connection.private_vpc_connection: Refreshing state... [id=projects%2Fbreatheroute%2Fglobal%2Fnetworks%2Fbreatheroute-prod-vpc:servicenetworking.googleapis.com]
module.infrastructure.module.cloud_sql.random_password.db_password: Refreshing state... [id=none]
module.infrastructure.module.cloud_sql.random_password.migrations_password: Refreshing state... [id=none]
module.infrastructure.module.cloud_sql.random_id.db_suffix: Refreshing state... [id=aoH0ag]
module.infrastructure.module.redis.google_redis_instance.main: Refreshing state... [id=projects/breatheroute/locations/europe-west4/instances/breatheroute-prod-redis]
module.infrastructure.module.cloud_sql.google_sql_database_instance.main: Refreshing state... [id=breatheroute-prod-db-6a81f46a]
module.infrastructure.module.cloud_sql.google_sql_database.app: Refreshing state... [id=projects/breatheroute/instances/breatheroute-prod-db-6a81f46a/databases/breatheroute]
module.infrastructure.module.cloud_sql.google_sql_user.app: Refreshing state... [id=breatheroute_app//breatheroute-prod-db-6a81f46a]
module.infrastructure.module.cloud_sql.google_sql_user.migrations: Refreshing state... [id=breatheroute_migrations//breatheroute-prod-db-6a81f46a]
module.infrastructure.module.cloud_run_worker.google_cloud_run_v2_service.main: Refreshing state... [id=projects/breatheroute/locations/europe-west4/services/breatheroute-prod-worker]
module.infrastructure.module.cloud_run_api.google_cloud_run_v2_service.main: Refreshing state... [id=projects/breatheroute/locations/europe-west4/services/breatheroute-prod-api]
module.infrastructure.module.cloud_run_api.google_cloud_run_v2_service_iam_member.public[0]: Refreshing state... [id=projects/breatheroute/locations/europe-west4/services/breatheroute-prod-api/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.infrastructure.module.cloud_sql.google_sql_database_instance.main will be updated in-place
  ~ resource "google_sql_database_instance" "main" {
        id                             = "breatheroute-prod-db-6a81f46a"
        name                           = "breatheroute-prod-db-6a81f46a"
        # (14 unchanged attributes hidden)

      ~ settings {
            # (15 unchanged attributes hidden)

          ~ ip_configuration {
              - require_ssl                                   = true -> null
              + ssl_mode                                      = "ENCRYPTED_ONLY"
                # (4 unchanged attributes hidden)
            }

            # (9 unchanged blocks hidden)
        }
    }

  # module.infrastructure.module.scheduler.google_cloud_scheduler_job.alert_evaluation will be created
  + resource "google_cloud_scheduler_job" "alert_evaluation" {
      + description = "Daily evaluation of commute alerts"
      + id          = (known after apply)
      + name        = "breatheroute-prod-alert-evaluation"
      + paused      = (known after apply)
      + project     = "breatheroute"
      + region      = "europe-west1"
      + schedule    = "0 5 * * *"
      + state       = (known after apply)
      + time_zone   = "Europe/Amsterdam"

      + pubsub_target {
          + attributes = {
              + "job_type" = "alert_evaluation"
            }
          + data       = "eyJqb2JfdHlwZSI6ImFsZXJ0X2V2YWx1YXRpb24iLCJsb29rYWhlYWRfaG91cnMiOjI0fQ=="
          + topic_name = "projects/breatheroute/topics/breatheroute-prod-alert-evaluation"
        }

      + retry_config {
          + max_backoff_duration = "600s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = "60s"
          + retry_count          = 3
        }
    }

  # module.infrastructure.module.scheduler.google_cloud_scheduler_job.alert_evaluation_evening will be created
  + resource "google_cloud_scheduler_job" "alert_evaluation_evening" {
      + description = "Evening evaluation for next-day commute alerts"
      + id          = (known after apply)
      + name        = "breatheroute-prod-alert-evaluation-evening"
      + paused      = (known after apply)
      + project     = "breatheroute"
      + region      = "europe-west1"
      + schedule    = "0 20 * * *"
      + state       = (known after apply)
      + time_zone   = "Europe/Amsterdam"

      + pubsub_target {
          + attributes = {
              + "job_type" = "alert_evaluation"
              + "priority" = "next_day"
            }
          + data       = "eyJqb2JfdHlwZSI6ImFsZXJ0X2V2YWx1YXRpb24iLCJsb29rYWhlYWRfaG91cnMiOjE4LCJwcmlvcml0eSI6Im5leHRfZGF5In0="
          + topic_name = "projects/breatheroute/topics/breatheroute-prod-alert-evaluation"
        }

      + retry_config {
          + max_backoff_duration = "600s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = "60s"
          + retry_count          = 3
        }
    }

  # module.infrastructure.module.scheduler.google_cloud_scheduler_job.provider_health_check will be created
  + resource "google_cloud_scheduler_job" "provider_health_check" {
      + description = "Periodic health check of external providers"
      + id          = (known after apply)
      + name        = "breatheroute-prod-provider-health-check"
      + paused      = (known after apply)
      + project     = "breatheroute"
      + region      = "europe-west1"
      + schedule    = "*/15 * * * *"
      + state       = (known after apply)
      + time_zone   = "Europe/Amsterdam"

      + pubsub_target {
          + attributes = {
              + "job_type" = "health_check"
            }
          + data       = "eyJjaGVja19vbmx5Ijp0cnVlLCJqb2JfdHlwZSI6ImhlYWx0aF9jaGVjayJ9"
          + topic_name = "projects/breatheroute/topics/breatheroute-prod-provider-refresh"
        }

      + retry_config {
          + max_backoff_duration = "60s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = "10s"
          + retry_count          = 1
        }
    }

  # module.infrastructure.module.scheduler.google_cloud_scheduler_job.provider_refresh will be created
  + resource "google_cloud_scheduler_job" "provider_refresh" {
      + description = "Hourly refresh of air quality and pollen data"
      + id          = (known after apply)
      + name        = "breatheroute-prod-provider-refresh"
      + paused      = (known after apply)
      + project     = "breatheroute"
      + region      = "europe-west1"
      + schedule    = "0 * * * *"
      + state       = (known after apply)
      + time_zone   = "Europe/Amsterdam"

      + pubsub_target {
          + attributes = {
              + "job_type" = "provider_refresh"
            }
          + data       = "eyJqb2JfdHlwZSI6InByb3ZpZGVyX3JlZnJlc2giLCJyZWZyZXNoX2FsbCI6dHJ1ZX0="
          + topic_name = "projects/breatheroute/topics/breatheroute-prod-provider-refresh"
        }

      + retry_config {
          + max_backoff_duration = "300s"
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = "30s"
          + retry_count          = 3
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @michaeldoye, Action: `pull_request`*